# 데이터 랭글링

In [3]:
import pandas as pd

url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url,error_bad_lines=False)

dataframe.head(5)

b'Skipping line 22: expected 1 fields, saw 7\nSkipping line 23: expected 1 fields, saw 2\nSkipping line 25: expected 1 fields, saw 3\nSkipping line 26: expected 1 fields, saw 3\nSkipping line 27: expected 1 fields, saw 2\nSkipping line 28: expected 1 fields, saw 2\nSkipping line 38: expected 1 fields, saw 5\nSkipping line 44: expected 1 fields, saw 2\nSkipping line 53: expected 1 fields, saw 2\nSkipping line 54: expected 1 fields, saw 5\nSkipping line 65: expected 1 fields, saw 2\nSkipping line 71: expected 1 fields, saw 2\nSkipping line 114: expected 1 fields, saw 2\nSkipping line 134: expected 1 fields, saw 2\nSkipping line 135: expected 1 fields, saw 2\nSkipping line 145: expected 1 fields, saw 2\n'

                                     <!DOCTYPE html>
0                                             <html>
1                                             <head>
2  \t<title>TinyURL.com - shorten that long URL i...
3               \t<base href="https://tinyurl.com/">
4  \t<meta name="google-site-verification" conten...

# 데이터프레임 만들기

In [4]:
import pandas as pd

dataframe = pd.DataFrame()

dataframe['Name'] = ['Jacky Jackon','Steven Stevenson']
dataframe['Age'] = [38,25]
dataframe['Driver'] = [True,False]

dataframe

               Name  Age  Driver
0      Jacky Jackon   38    True
1  Steven Stevenson   25   False

In [5]:
new_person = pd.Series(['Molly Mooney', 40, True], index = ['Name','Age','Driver'])

dataframe.append(new_person, ignore_index = True)

               Name  Age  Driver
0      Jacky Jackon   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [6]:
import numpy as np

data = [['Jacky Jackson', 38, True],['Steven Stevenson',25,False]]
matrix = np.array(data)
pd.DataFrame(matrix,columns = ['Name','Age','Driver'])

               Name Age Driver
0     Jacky Jackson  38   True
1  Steven Stevenson  25  False

In [7]:
pd.DataFrame(data,columns = ['Name','Age','Driver'])

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [8]:
data = {'Name' : ['Jacky Jackson', 'Steven Stevenson'], 'Age' : [38,25], 'Driver' : [True,False]}

pd.DataFrame(data)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [10]:
data = [{'Name' : 'Jacky Jackson', 'Age' : 38, 'Driver' : True},
        {'Name' : 'Steven Stevenson', 'Age' : 25, 'Driver' : False}]

pd.DataFrame(data,index = ['row1', 'row2'])

                  Name  Age  Driver
row1     Jacky Jackson   38    True
row2  Steven Stevenson   25   False

# 데이터 설명하기

In [12]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

dataframe = pd.read_csv(url)

dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [13]:
dataframe.shape

(1313, 6)

In [14]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

# 데이터프레임 탐색하기

In [15]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [16]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [17]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [18]:
dataframe = dataframe.set_index(dataframe['Name'])

dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [19]:
dataframe.loc[:'Allison, Miss Helen Loraine','Age':'Sex']

                               Age     Sex
Name
Allen, Miss Elisabeth Walton  29.0  female
Allison, Miss Helen Loraine    2.0  female

# 조건에 따라 행 선택하기

In [20]:
dataframe[dataframe['Sex'] == 'female'].head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [23]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

# 값 치환하기

In [24]:
dataframe['Sex'].replace('female','Woman').head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

In [25]:
dataframe['Sex'].replace(['female','male'],['Woman','Man']).head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

In [26]:
dataframe.replace(1,'one').head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29,female,one,one
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2,female,0,one

In [35]:
dataframe.replace(r"1st","First",regex = True).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,female,0,1

In [32]:
dataframe.replace(['female','male'],'person').head(3)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,person,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,person,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,person,0,0

In [30]:
dataframe.replace({'female' :1,'male':0}).head(3)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,1,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,1,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.0,0,0,0

# 열 이름 바꾸기

In [37]:
dataframe.rename(columns = {'PClass' : 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [38]:
dataframe.rename(columns = {'PClass' : 'Passenger Class', 'Sex' : 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [41]:
import collections

columns_names = collections.defaultdict(str)

for name in dataframe.columns:
    columns_names[name]

columns_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

In [42]:
dataframe.rename(str.lower,axis = 'columns').head(2)

,name,pclass,age,sex,survived,sexcode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

# 최솟값, 최댓값, 합, 평균 계산 및 개수 세기

In [43]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

dataframe = pd.read_csv(url)

print('최댓값:', dataframe['Age'].max())
print('최댓값:', dataframe['Age'].min())
print('최댓값:', dataframe['Age'].mean())
print('최댓값:', dataframe['Age'].sum())
print('카운트:', dataframe['Age'].count())

최댓값: 71.0
최댓값: 0.17
최댓값: 30.397989417989415
최댓값: 22980.88
카운트: 756

In [44]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

# 고유한 값 찾기

In [45]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [46]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [47]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [49]:
dataframe['PClass'].nunique()

4

In [50]:
dataframe.nunique()

Name        1310
PClass         4
Age           75
Sex            2
Survived       2
SexCode        2
dtype: int64

# 누락된 값 다루기

In [51]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [52]:
import numpy as np

dataframe['Sex'] = dataframe['Sex'].replace('male',np.nan)

In [53]:
dataframe = pd.read_csv(url, na_values=[np.nan,'NONE',-999])

In [56]:
dataframe.isnull().sum()

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

In [57]:
dataframe = pd.read_csv(url, na_values =['female'],keep_default_na = False)

In [58]:
dataframe[12:14]

                            Name PClass Age   Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st       NaN         1        1
13      Barkworth, Mr Algernon H    1st      male         1        0

In [59]:
dataframe = pd.read_csv(url, na_filter = False)
dataframe[12:14]

                            Name PClass Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st      female         1        1
13      Barkworth, Mr Algernon H    1st        male         1        0

# 열 삭제하기

In [60]:
dataframe.drop('Age',axis = 1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [61]:
dataframe.drop(['Age','Sex'],axis = 1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [62]:
dataframe.drop(dataframe.columns[1],axis =1 ).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

# 행 삭제하기

In [63]:
dataframe[dataframe['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [64]:
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [65]:
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

# 중복된 행 삭제하기

In [66]:
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [67]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [68]:
dataframe.drop_duplicates(subset=['Sex'],keep = 'last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd        female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

# 값에 따라 행을 그룹핑하기

In [70]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

dataframe = pd.read_csv(url)

dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [71]:
dataframe.groupby('Sex')

In [72]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [73]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

# 시간에 따라 행을 그룹핑하기

In [75]:
time_index = pd.date_range('06/06/2017',periods = 100000, freq = '30S')

dataframe = pd.DataFrame(index = time_index)

dataframe['Sale_Amount'] = np.random.randint(1,10,100000)

dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86557
2017-06-18       100638
2017-06-25       101428
2017-07-02       101065
2017-07-09       100842
2017-07-16        10203

In [76]:
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            3
2017-06-06 00:00:30            3
2017-06-06 00:01:00            4

In [77]:
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     5.009086
2017-06-25     5.011558
2017-07-09     5.007614
2017-07-23     4.905288

In [78]:
dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [79]:
dataframe.resample('M',label = 'left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [80]:
dataframe.resample('MS').count()

            Sale_Amount
2017-06-01        72000
2017-07-01        28000

# 열 원소 순회하기

In [82]:
import pandas as pd

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

dataframe = pd.read_csv(url)

for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [83]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

# 모든 열 원소에 함수 적용하기

In [84]:
def uppercase(x):
    return x.upper()

dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [85]:
dataframe['Survived'].map({1:'Live',0:'Dead'})[:5]

0    Live
1    Dead
2    Dead
3    Dead
4    Live
Name: Survived, dtype: object

In [86]:
dataframe['Age'].apply(lambda x, age:x<age, age = 30)[:5]

0     True
1     True
2    False
3     True
4     True
Name: Age, dtype: bool

In [87]:
dataframe.apply(lambda x :max(x))

Name        del Carlo, Mrs Sebastiano (Argenia Genovese)
PClass                                               3rd
Age                                                   71
Sex                                                 male
Survived                                               1
SexCode                                                1
dtype: object

In [88]:
def truncate_string(x):
    if type(x) == str:
        return x[:20]
    return x

dataframe.applymap(truncate_string)[:5]

                   Name PClass    Age     Sex  Survived  SexCode
0  Allen, Miss Elisabet    1st  29.00  female         1        1
1  Allison, Miss Helen     1st   2.00  female         0        1
2  Allison, Mr Hudson J    1st  30.00    male         0        0
3  Allison, Mrs Hudson     1st  25.00  female         0        1
4  Allison, Master Huds    1st   0.92    male         1        0

# 그룹에 함수 적용하기

In [89]:
dataframe.groupby('Sex').apply(lambda x:x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

# 데이터프레임 연결하기

In [92]:
data_a = {'id' : ['1','2','3'], 'first' : ['Alex','Amy','Allen'],'last' : ['Anderson','Ackerman','Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id','first','last'])

data_b = {'id' : ['4','5','6'], 'first' : ['Billy','Brian','Bran'],'last' : ['Bonder','Black','Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id','first','last'])

pd.concat([dataframe_a,dataframe_b],axis = 0, ignore_index = True)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
3  4  Billy    Bonder
4  5  Brian     Black
5  6   Bran   Balwner

In [94]:
pd.concat([dataframe_a,dataframe_b],axis = 1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [96]:
row = pd.Series([10,'Chris','Chillon'], index = ['id','first','last'])

dataframe_a.append(row, ignore_index = True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

# 데이터프레임 병합하기

In [97]:
employee_data = {'employee_id' : ['1','2','3','4'],'name' : ['Amy Jones','Allen Keys','Alice Bees', 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id','name'])

sales_data = {'employee_id' : ['3','4','5','6'],'total_sales' : [23456,2512,2345,1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id','total_sales'])

pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [98]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id',how = 'outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [99]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id',how = 'left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [100]:
pd.merge(dataframe_employees, dataframe_sales, left_on = 'employee_id',right_on = 'employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512